Autodesk.Revit.DB.RenderingQuality
Indicates the rendering quality in rendering settings.
Since:
2013

Autodesk.Revit.DB.RenderingQuality.Custom
Custom level quality.

Autodesk.Revit.DB.RenderingQuality.VeryHigh
Very high level quality.

Autodesk.Revit.DB.RenderingQuality.High
High level quality.

Autodesk.Revit.DB.RenderingQuality.Medium
Medium level quality.

Autodesk.Revit.DB.RenderingQuality.Draft
Draft level quality.